export default {
  username: /^[\u4e00-\u9fa5]{0,}$/, // 中文
  tel: /^1[3|4|5|6|7|8|9]\d{9}$/, // 电话
  tel2: /^[1][3,4,5,7,8][0-9]{9}$/, // 电话
  privateIdEntityId: /^(^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)/, // 身份证
  noprivateIdEntityId: /^[0-9x]*$/, // 模糊查询身份证
  number: /^[0-9]*$/, // 数字
  alnum: /^[A-Za-z0-9]+$/, // 英文和数字
  kyop: /^[\u4E00-\u9FA50-9]+$/, // 中文和数字
  english: /^[A-Za-z/ ]+$/, // 英文
  data: /^\d{4}-\d{1,2}-\d{1,2}/, // 年月日
  nospace: /^[^\s]+$/, // 不含空格
  money: /^\d+(\.\d{1,2})?$/, // 带最多2位小数的数字
  planMoney: /^\d{1,10}(\.\d{1,4})?$/, // 带最多4位小数的数字
  contractMoney: /^\d{1,10}(\.\d{1,6})?$/, // 带最多6位小数的数字
  homenumber: /\d{3}-\d{8}|\d{4}-\d{7}/, // 国内电话
  companynumber: /^\d{5}-\d{4}$|^\d{4}-\d{8}$|^\d{4}-\d{7}$|^\d{4}$/,
  companynumberone: /^\d{3,5}-\d{4,8}|\d{4}|\d{11}$/,
  phoneNumber: /^(^1[3|4|5|7|8]\d{9})|(\d{3}-\d{8}|\d{4}-\d{x7})$/,
  datatime: /^\-\d+$/,
  email: /^[A-Za-z\d]+([-_.][A-Za-z\d]+)*@([A-Za-z\d]+[-.])+[A-Za-z\d]{2,4}$/, // 邮箱验证
  // integer: /^[+]{0}(\d+)\d+(\.\d*)?$/                                       //正整数验证
  integer: /^[1-9]\d*$/,
  // ip: /^10(\.([2][0-4]\d|[2][5][0-5]|[01]?\d?\d)){3}$/,
  MAC:/^[a-fA-F0-9]{2}(-[a-fA-F0-9]{2}){5}$|^[a-fA-F0-9]{2}(:[a-fA-F0-9]{2}){5}$|^[a-fA-F0-9]{12}$|^[a-fA-F0-9]{4}(\.[a-fA-F0-9]{4}){2}$/,
  ip: /^((25[0-5]|2[0-4]\d|((1\d{2})|([1-9]?\d)))\.){3}(25[0-5]|2[0-4]\d|((1\d{2})|([1-9]?\d)))$/,
  ip6:/^(([a-f0-9]{1,4}(:[a-f0-9]{1,4}){7}|[a-f0-9]{1,4}(:[a-f0-9]{1,4}){0,7}::[a-f0-9]{0,4}(:[a-f0-9]{1,4}){0,7}))$/,
  SIZE: /^([0-9]*(GB|G|TB|T|K|KB|C)(\/)?)+$/ // 内存16GB/16G
  // email:/^[A-Za-z\d]+[]/
}
